
{
  "roscon-de-reyes-three-kings-cake": {
    "RecipeCodeName": "roscon-de-reyes-three-kings-cake",
    "Link": "https://travelbybaking.com/roscon-de-reyes-three-kings-cake/",
    "ShortDescription": "Roscon de Reyes (Three Kings or Three Wise Men cake)",
    "Title": "Roscon de Reyes (Three Kings cake)",
    "Description": "Roscon de Reyes, Three Wise Men or Three Kings Cake, is a typical Christmas sweet in Spain. It is a round, sweet dough bun decorated with slices of candied fruit in various colours, which is traditionally served on Three Kings day, January 6. It can be eaten as is or filled with whipped cream or a wide variety of other creams.\nUsually Roscon de Reyes contains a small figurine of a king hidden in the dough. Whoever gets the slice with the king is the king of the day. There can also be a dried bean hidden in the cake. Whoever gets the bean, pays for the cake.\n",
    "Ingredients": ["65 g / 0.3 cups milk (2% or full fat)\n35 g / 0.2 cups butter (unsalted)\n1 tsp granulated sugar\n15 g fresh yeast (or 6 g active dry yeast)\n250 – 280 g / 2.1 – 2.3 cups strong flour (bread flour)\n60 g / 0.5 cups powdered sugar\nZest of 1 small orange and 1 lemon\n2 eggs\n15 g / 1 tbsp orange flower water (optional)\nA pinch of salt\nFor decoration:\nCandied fruit (orange, lemon, cherries, etc.)\nAlmond flakes (optional)\n1 tbsp granulated sugar with a few drops of water"],
    "Directions": ["\nDirections\nPut milk, 1 teaspoon of sugar and the butter in a small pot, and heat on the stove on low heat to melt the butter. When the butter has melted, leave the milk to cool for a few minutes.\nWhen the milk is just slightly warm, fine to touch, activate the yeast. Crumble the fresh yeast in a small bowl, add to it the milk with butter and sugar, and stir to dissolve the yeast a bit. Mix in a few tablespoons of flour and leave it for about 10 min till the yeast is foamy.\nZest an orange and a lemon, and mix the zest with the powdered sugar.\nPut the activated yeast in a big bowl. Add to it one egg, powdered sugar mixed with the orange and lemon zest and orange flower water (optional), which is traditionally used in Roscon de Reyes.\nAdd a bit of salt to the flour and sift it in the bowl. Do not add all the flour at once in case you do not need it all for the dough. If the dough is sticky, add a bit of flour, gradually – tablespoon, half a tablespoon, at a time till the dough starts to hold together and does not stick to the sides of the bowl any more.\nPut some cooking oil on your hands and the kitchen countertop. The oil will help to prevent the dough from sticking and there won’t be more flour added to the dough to avoid adding too much flour to it. And knead the dough for a few minutes till it is smooth, elastic and does not stick any more. The dough should be soft and not need much strength to knead it.\nRoll the dough into a ball, pat with a little bit of oil to help to keep the dough moist and put it in the bowl. Cover the bowl with a towel or a lid and put in a warm place for the dough to grow for about 5 hours.\nWrap the small king figure and a bean (if using) in small pieces of parchment paper.\nGrease a piece of parchment paper the size of the baking tray with some oil.\nPut the dough on the kitchen countertop, put the king figure and bean inside the dough and shape the dough into a ball. Cover the dough with a towel and let it rest for 5 min.\nShape the Roscon as a ring with a big hole in the middle so that it does not close while the dough grows and bakes. Move it onto the prepared parchment paper and adjust as needed. Pull the Roscon on the baking tray with the help of the parchment paper. Cover with a towel and put in a warm place to proof for 2 more hours.\nSet the oven to heat to 180 degrees Celsius or 400 degrees Fahrenheit.\nTo brush the Roscon de Reyes, break an egg in a glass, add to it about a teaspoon of water and beat it a little with a fork.\nAdd a few drops of water to a tablespoon of sugar and mix it so that the sugar is just a little wet and forms kind of crumbs.\nBrush the Roscon gently with the egg wash. Arrange the candied fruit on top, as well as sprinkle almond flakes (optional). And sprinkle the sugar crumbs as last.\nBake the Roscon for about 20 – 25 minutes till it’s nicely golden brown. To prevent the Roscon from browning too much, put a piece of aluminium foil loosely on top when it has started to brown. Remove Roscon from the oven and let it cool a bit on the baking tray before moving it.\nYou can eat it the Roscon like that or cut horizontally and put whipped cream or your preferred cream filling in the middle. Enjoy!\nNotes\nFor best results, measure ingredients with a scale. All recipes are made with weighed ingredients using grams. Cup measurements are provided for your convenience."],
    "ServingSize": {
      "colName": "Serving Size:",
      "Size": "1 big Roscon de Reyes"
    },
    "rTime": ["Time:", "Prep time: 1 h", "Wait time: 7 h", "Bake time: 25 min"],
    "VideoUrl": {
      "src": "https://www.youtube.com/embed/I_vuyHNVtcM?feature=oembed",
      "alt": "SPANISH ROSCON DE REYES | THREE WISE MEN RING-SHAPED CAKE"
    }
  }
}
