{
  "apple-sheet-cake-with-cottage-cheese-latvian-platsmaize": {
    "RecipeCodeName": "apple-sheet-cake-with-cottage-cheese-latvian-platsmaize",
    "Ingredients": [
      "Serving Size:\nMakes: 1 sheet cake\nTime:\nPrep time: 60 min\nResting time: 30 min\nCook time: 30 min\nDifficulty:\nMedium\nYou can have an apple sheet cake and a cottage cheese sheet cake, but why not combine the both and have a rich, moist and delicious cake with two layers of filling? Made with a yeast dough base, creamy cottage cheese mid layer and thin fresh apple slices on top, sprinkled with cinnamon and sugar.\nA sheet cake made this way has been one of my favourites since childhood when baked on special occasions or just because of craving something sweet and delicious.\nIngredients\nFor the cottage cheese layer:\n450 – 500 grams cottage cheese\n1 tablespoon flour\n1 egg\n70 grams sugar\n50 grams sour cream\nvanilla\nraisins (optional)\nFor the apple layer:\n3 medium size apples\n100 grams sugar\n2 eggs\n150 grams sour cream\n1 tablespoon flour\n2 teaspoons cinnamon\nEquipment\nThe baking tray I used is 40 x 30 cm or 11.81 x 15.75 inches.\nDirections\nFor the dough recipe and instructions see Soft and delicious mini bacon buns (Latvian piragi).\nPrepare the baking tray by inserting parchment paper and sprinkling some flour in it.\nSprinkle some flour on the kitchen countertop and remove the dough from the fridge.\nRoll the dough in a rectangle shape approximately the size of the baking tray and move it to the tray.\nAdjust the dough as needed so that it fits the size of the tray – there are no empty gaps and the dough is not up on the sides of the tray. Put the tray aside in a warm place for the dough to rest.\nSet the oven to heat to 180 degrees Celsius or 350 degrees Fahrenheit.\nIf using dry cottage cheese, either blend or rub it through a sieve as much as you can.\nAdd in the bowl the cottage cheese and all the ingredients for the cottage cheese layer – egg, sugar, sour cream, vanilla and flour. Mix it well together and put the bowl aside.\nMix the cinnamon with 2 teaspoons of sugar.\nMix the remaining sugar with eggs for the apple layer.\nAdd to it the sour cream and mix to dissolve the cream.\nAdd the flour and mix till the batter is smooth. Put it also aside.\nPeel and slice apples in thin slices.\nPut the cottage cheese mix on top of the dough and spread it to cover the whole sheet of dough.\nPut apple slices in rows on top of the cottage cheese and arrange them so that a layer of apples covers the whole cake.\nUsing a spoon, spread the egg, cream mix over the apples.\nSprinkle the sugar, cinnamon mix over the cake and put it in the oven to bake for approximately 30 minutes.\nRemove the cake from the oven and let it cool in the baking tray for a few minutes before moving it and cutting.\nEnjoy!"
    ]
  },
  "carrot-sheet-cake-latvian-burkanu-platsmaize": {
    "RecipeCodeName": "carrot-sheet-cake-latvian-burkanu-platsmaize",
    "Ingredients": [
      "Serving Size:\n12 – 16 pieces\nTime:\nPrep time: 1 h\nWait time: up to 2 h\nBake time: 30 min\nDifficulty:\nMedium\nEquipment\nI am using a baking tray of size: 24.5 x 21 x 4 cm / 9.5 x 8.5 x 1.5 inches (fits 1.5 litres / 6.25 cups)\nIngredients\nFor the carrot layer:\n1 kg / 2.2 lbs carrots\n1/2 tsp salt\n3 eggs\n200 g / 1 cup granulated sugar\n2 tsp cinnamon or gingerbread spices\n50 g / 0.4 cups all-purpose flour\n100 g / 0.4 cups whipping cream\nFor the yeast dough base:\n70 ml / 0.3 cups milk (2% or full fat)\n15 g fresh yeast (or 6 g active dry yeast)\n150 g / 1.3 cups all-purpose flour\n40 g / 0.2 cups butter (unsalted)\n1/2 tbsp granulated sugar\n1/8 tsp salt\nDirections\nBoil carrots with 1/2 tsp salt till they are soft. Drain, leave to cool and peel.\nPut milk, butter, sugar and salt in a small pot and warm on medium heat till the butter melts. Let it cool so that it is fine to touch before adding to the yeast.\nCrumble yeast in a bowl, add to it about half of the warm milk and a few tablespoons of flour to activate it. Mix and leave for about 10 min till the yeast becomes bubbly and grows in volume.\nSift flour in a big bowl. Add to it the remaining milk and the yeast. Mix everything well to form consistent dough. If the dough is too sticky, add a tablespoon of flour at a time. The dough should not stick to hands or the bowl. Knead the dough on the kitchen countertop for a few minutes till it is smooth and elastic. Shape into a ball, put in a bowl, cover with a towel and leave in a warm place till the dough doubles in size. It can take an hour or two depending on how warm the place is where you put the dough.\nPut a piece of parchment paper in the baking tray so that it is easier to remove the cake when it’s done. And grease the parchment paper with a bit of oil or butter.\nDust the kitchen countertop with a bit of flour and roll the dough thin, approximately in the size of the baking tray. Move the dough to the baking tray and fold the sides down so that the dough is only on the bottom of the baking tray. Cover the baking tray with a towel and leave the dough to rest while preparing the carrot filling.\nSet the oven to heat to 180 degrees Celsius or 400 degrees Fahrenheit.\nEither grate or blend the carrots. If blending, add eggs to the carrots in the blender.\nPut the carrot puree in a big bowl, add eggs if not done yet, about 3/4ts of the sugar, spices and flour. Mix everything well.\nPour the carrot mixture over the dough in the baking tray and level.\nMix the whipping cream with the remaining sugar and drizzle it over the carrot filling.\nBake the carrot sheet cake for about 30 min till the top of the cake looks set and has browned a little. Remove the cake from the oven and let it cool a little before removing from the baking tray.\nCut off the sides of the sheet cake to better see the layers and enjoy!"
    ]
  },
  "crispy-and-spicy-chicken-wings-in-the-oven": {
    "RecipeCodeName": "crispy-and-spicy-chicken-wings-in-the-oven",
    "Ingredients": [
      "Serving Size:\n1 kg chicken wings\n(about 20 pieces)\nTime:\nPrep time: 20 min\nWait time: 2 h\nCook time: 80 min\nDifficulty:\nMedium\nIngredients\n1 kg (2.2 lb) chicken wings, cut into two pieces to separate drumette and wingette\n40 g (0.3 cups) whole wheat flour\n30 g (0.3 cups) all-purpose flour\n1/2 tsp salt\n1/2 tsp sweet paprika powder\n1/4 tsp cayenne pepper\nFor the sauce:\n60 g (2.1 oz) unsalted butter\n40 ml (1.4 oz) Tabasco sauce\n1 tbsp brown sugar\n1/4 tsp sweet paprika powder\n1/4 tsp salt\n1/4 tsp cayenne pepper\n5 ml (1 tsp) balsamic vinegar\n10 ml (2 tsp) chilli sauce\nDirections\nIn a small bowl mix the flours with salt, sweet paprika and cayenne pepper.\nPat the chicken wings with a paper towel to make sure they are dry.\nPut the flour mix and the wings in a plastic or Ziploc bag and carefully shake to coat the wings with the flour/spice mix and put in the fridge for about 2 hours or till ready to bake.\nMix in a small bowl all the ingredients for the sauce: butter, Tabasco sauce, sweet paprika powder, salt, cayenne pepper, brown sugar, balsamic vinegar and chilli sauce. Heat the sauce in a water bath to melt the butter and simmer the sauce for a minute. Put the sauce aside for later.\nHeat the oven to 120° C or 285° F with fan. If you have a roasting function in the oven, use that.\nPut a piece of parchment paper on a baking tray to put in the oven underneath the grill tray (to prevent fat dripping in the oven).\nShake off the excess flour and arrange the chicken wings on a grill tray.\nRoast the wings for 30 min. Flip the wings, increase the oven temperature to 220° C or 465° F and roast the wings for 35 to 50 minutes till they are golden brown and look crispy.\nPut the wings in the bowl, pour the sauce over and carefully mix to coat the wings with the sauce. Be careful as the sauce is spicy.\nEnjoy!"
    ]
  },
  "roscon-de-reyes-three-kings-cake": {
    "RecipeCodeName": "roscon-de-reyes-three-kings-cake",
    "Ingredients": [
      "Serving Size:\n1 big Roscon de Reyes\nTime:\nPrep time: 1 h\nWait time: 7 h\nBake time: 25 min\nDifficulty:\nMedium\n65 g / 0.3 cups milk (2% or full fat)\n35 g / 0.2 cups butter (unsalted)\n1 tsp granulated sugar\n15 g fresh yeast (or 6 g active dry yeast)\n250 – 280 g / 2.1 – 2.3 cups strong flour (bread flour)\n60 g / 0.5 cups powdered sugar\nZest of 1 small orange and 1 lemon\n2 eggs\n15 g / 1 tbsp orange flower water (optional)\nA pinch of salt\nFor decoration:\nCandied fruit (orange, lemon, cherries, etc.)\nAlmond flakes (optional)\n1 tbsp granulated sugar with a few drops of water\nDirections\nPut milk, 1 teaspoon of sugar and the butter in a small pot, and heat on the stove on low heat to melt the butter. When the butter has melted, leave the milk to cool for a few minutes.\nWhen the milk is just slightly warm, fine to touch, activate the yeast. Crumble the fresh yeast in a small bowl, add to it the milk with butter and sugar, and stir to dissolve the yeast a bit. Mix in a few tablespoons of flour and leave it for about 10 min till the yeast is foamy.\nZest an orange and a lemon, and mix the zest with the powdered sugar.\nPut the activated yeast in a big bowl. Add to it one egg, powdered sugar mixed with the orange and lemon zest and orange flower water (optional), which is traditionally used in Roscon de Reyes.\nAdd a bit of salt to the flour and sift it in the bowl. Do not add all the flour at once in case you do not need it all for the dough. If the dough is sticky, add a bit of flour, gradually – tablespoon, half a tablespoon, at a time till the dough starts to hold together and does not stick to the sides of the bowl any more.\nPut some cooking oil on your hands and the kitchen countertop. The oil will help to prevent the dough from sticking and there won’t be more flour added to the dough to avoid adding too much flour to it. And knead the dough for a few minutes till it is smooth, elastic and does not stick any more. The dough should be soft and not need much strength to knead it.\nRoll the dough into a ball, pat with a little bit of oil to help to keep the dough moist and put it in the bowl. Cover the bowl with a towel or a lid and put in a warm place for the dough to grow for about 5 hours.\nWrap the small king figure and a bean (if using) in small pieces of parchment paper.\nGrease a piece of parchment paper the size of the baking tray with some oil.\nPut the dough on the kitchen countertop, put the king figure and bean inside the dough and shape the dough into a ball. Cover the dough with a towel and let it rest for 5 min.\nShape the Roscon as a ring with a big hole in the middle so that it does not close while the dough grows and bakes. Move it onto the prepared parchment paper and adjust as needed. Pull the Roscon on the baking tray with the help of the parchment paper. Cover with a towel and put in a warm place to proof for 2 more hours.\nSet the oven to heat to 180 degrees Celsius or 400 degrees Fahrenheit.\nTo brush the Roscon de Reyes, break an egg in a glass, add to it about a teaspoon of water and beat it a little with a fork.\nAdd a few drops of water to a tablespoon of sugar and mix it so that the sugar is just a little wet and forms kind of crumbs.\nBrush the Roscon gently with the egg wash. Arrange the candied fruit on top, as well as sprinkle almond flakes (optional). And sprinkle the sugar crumbs as last.\nBake the Roscon for about 20 – 25 minutes till it’s nicely golden brown. To prevent the Roscon from browning too much, put a piece of aluminium foil loosely on top when it has started to brown. Remove Roscon from the oven and let it cool a bit on the baking tray before moving it.\nYou can eat it the Roscon like that or cut horizontally and put whipped cream or your preferred cream filling in the middle. Enjoy!"
    ]
  },
  "venezuelan-christmas-bread-pan-de-jamon": {
    "RecipeCodeName": "venezuelan-christmas-bread-pan-de-jamon",
    "Ingredients": [
      "Serving Size:\nMakes: 2 loaves of pan de jamón\nTime:\nPrep time: 30 min\nResting time: 2 hours\nCook time: 25 min\nDifficulty:\nMedium\nIngredients\nFor the dough:\n15 grams fresh yeast (or 5 grams dry yeast)\n25 grams sugar\n100 – 200 grams warm milk\n500 grams flour, plus some flour for kneading and dusting\n15 grams butter\n1 egg\n1/2 teaspoon salt\nFor the filling:\n150 grams bacon in slices\n300 grams ham in slices\n150 grams green olives with paprika filling\n2 tablespoons raisins\nTo brush pan de jamón before baking:\n1 egg\n2 teaspoons brown sugar\nInstructions\nCrumble yeast in a small bowl.\nAdd the sugar, about 50 g of warm milk and a few tablespoons of flour. Mix everything and put the bowl aside in a warm place.\nWhen the yeast has grown a bit, mix the flour with salt and butter.\nAdd the egg and the yeast mixture.\nMix everything and gradually add the warm milk so that you can form dough.\nKnead the dough and put it in a bowl. Cover the bowl and put it in a warm place for 1 hour.\nIn the meanwhile, cut the olives in half as that way it is easier to roll them in.\nCover a baking tray with parchment paper or a silicone baking mat and dust some flour on it.\n1 hour later the dough should have doubled in size.\nDust the kitchen countertop with some flour, remove the dough from the bowl and cut it into 2 pieces for the 2 loaves.\nRoll one piece of the dough into a rectangle.\nPut half of the bacon slices on the dough.\nThen cover the dough with the slices of ham.\nPut on top olives in a few rows and randomly put raisins on top.\nRoll the dough and close the ends of the loaves.\nMake sure to have the closing of the roll underneath it and put it on the baking tray. Cover the loaf with a towel and prepare the second loaf the same way.\nLeave both loaves to rest for 1 hour. The dough will grow a bit again.\nSet the oven to heat to 180° C or 350° F.\nUsing a fork, make some holes on top of pan de jamón loaves.\nMix the egg with the brown sugar and brush with it the loaves generously.\nPut them in the oven to bake for 20 to 25 minutes till they are nicely golden brown.\nRemove pan de jamón from the oven and let it cool in the baking tray for a bit before moving and cutting.\nEnjoy!"
    ]
  },
  "danish-leftover-cake-student-bread": {
    "RecipeCodeName": "danish-leftover-cake-student-bread",
    "Ingredients": [
      "Serving Size:\nCake in size of 24.5 x 21 x 4 cm\nTime:\nPrep time: 1 h\nBake time: 20 min\nWait time: 1.5 h\nDifficulty:\nMedium\nEquipment\nI am using a baking tray size: 24.5 x 21 x 4 cm / 9.5 x 8.5 x 1.5 inches (fits 1.5 litres / 6.25 cups).\nIngredients\nFor the shortcrust pastry base:\n150 g / 1.3 cups all-purpose flour\n25 g / 0.2 cups powdered sugar\n1/8 tsp salt\n100 g / 0.4 cups butter (unsalted, cold)\n1 egg yolk\n1 tsp vanilla\nCake layer:\n600 g / 1.3 lbs leftover cake – muffins, pound cake, cookies, etc. (Defrost, if frozen)\n150 g / 0.9 cups dark chocolate\n4 tbsp (about 40 g) unsweetened cocoa powder\n6 tbsp jam (I use raspberry jam)\n4 tbsp rum\nIcing on top:\n200 g / 1.7 cups powdered sugar\nLemon juice\n2 tsp of raspberry jam without seeds (optional)"
    ]
  }
}
